#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
data.azurerm_client_config.current: Reading...
azurerm_service_plan.serviceplan: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/langchain-experiments/providers/Microsoft.Web/serverfarms/serviceplan]
azurerm_resource_group.LangChain-Experiments: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1kNmY5YzUwOS04YWFkLTQ4MjctYWY4ZS0yYzc2ZWFmNzEwYWE7b2JqZWN0SWQ9MTI4NWFhOTktNTliMi00ZWViLWEyOTktYzVlNTY0NDVjZmUxO3N1YnNjcmlwdGlvbklkPTEyZDg2MDcyLTAzNmMtNGNkZS05YjY1LTVkNzU2MDE2NTM4Njt0ZW5hbnRJZD01NDY5ZDEzNy0zNDlmLTQwNjAtYjgwNy1mZWYzYjQ5MjgxMmI=]
azurerm_storage_account.gnwosutfstatestorageacc: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Storage/storageAccounts/gnwosutfstatestorageacc]
azurerm_cognitive_account.LangChain_Experiments: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.CognitiveServices/accounts/LangChain-Experiments]
azurerm_redis_cache.bot-cache: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Cache/redis/LangChain-Experiments]
azurerm_key_vault.slackbot_secrets: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.KeyVault/vaults/slackbot-secrets]
azurerm_linux_web_app.slackbotwebapp: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Web/sites/slackbotwebapp]
azurerm_key_vault_secret.slackbot_synth_primary_access_key: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/primary-access-key/8e8faa1b9bfd438bb5d52ec72a17fd62]
azurerm_key_vault_secret.slackbot_synth_endpoint: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/slackbot-synth-endpoint/2452d172c1e2463bac31c9d173be3e68]
azurerm_key_vault_secret.slackbot_redis_hostname: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/redis-key/06aa53da47844ecc8ea17ac4e58dee65]
azurerm_key_vault_secret.slackbot_redis_key: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/redis-key/eea6893fe57e4f0e87a4e54e4e27d065]
azurerm_storage_container.gnwosutfstatestoragecont: Refreshing state... [id=https://gnwosutfstatestorageacc.blob.core.windows.net/gnwosutfstatestoragecont]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_key_vault.slackbot_secrets will be updated in-place
  ~ resource "azurerm_key_vault" "slackbot_secrets" {
      ~ access_policy                   = [
          ~ {
              ~ certificate_permissions = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "ManageContacts",
                  - "ManageIssuers",
                  - "GetIssuers",
                  - "ListIssuers",
                  - "SetIssuers",
                  - "DeleteIssuers",
                  - "Purge",
                ]
              ~ key_permissions         = [
                    # (1 unchanged element hidden)
                    "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "GetRotationPolicy",
                  - "SetRotationPolicy",
                  - "Rotate",
                  - "Purge",
                  - "Release",
                  - "Encrypt",
                  - "Decrypt",
                  - "UnwrapKey",
                  - "WrapKey",
                  - "Verify",
                  - "Sign",
                ]
              ~ secret_permissions      = [
                    # (2 unchanged elements hidden)
                    "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Purge",
                ]
                # (4 unchanged attributes hidden)
            },
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "ManageContacts",
                  - "ManageIssuers",
                  - "GetIssuers",
                  - "ListIssuers",
                  - "SetIssuers",
                  - "DeleteIssuers",
                ]
              - key_permissions         = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "GetRotationPolicy",
                  - "SetRotationPolicy",
                  - "Rotate",
                ]
              - object_id               = "948bddda-2615-40bb-98b8-2554b364b54a"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                ]
              - storage_permissions     = []
              - tenant_id               = "5469d137-349f-4060-b807-fef3b492812b"
            },
        ]
        id                              = "/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.KeyVault/vaults/slackbot-secrets"
        name                            = "slackbot-secrets"
        tags                            = {}
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.slackbot_redis_hostname will be updated in-place
  ~ resource "azurerm_key_vault_secret" "slackbot_redis_hostname" {
        id                      = "https://slackbot-secrets.vault.azure.net/secrets/redis-key/06aa53da47844ecc8ea17ac4e58dee65"
        name                    = "redis-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.slackbot_synth_primary_access_key must be replaced
-/+ resource "azurerm_key_vault_secret" "slackbot_synth_primary_access_key" {
      ~ id                      = "https://slackbot-secrets.vault.azure.net/secrets/primary-access-key/8e8faa1b9bfd438bb5d52ec72a17fd62" -> (known after apply)
      ~ name                    = "primary-access-key" -> "slackbot-synth-primary-access-key" # forces replacement
      ~ resource_id             = "/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.KeyVault/vaults/slackbot-secrets/secrets/primary-access-key/versions/8e8faa1b9bfd438bb5d52ec72a17fd62" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.KeyVault/vaults/slackbot-secrets/secrets/primary-access-key" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "8e8faa1b9bfd438bb5d52ec72a17fd62" -> (known after apply)
      ~ versionless_id          = "https://slackbot-secrets.vault.azure.net/secrets/primary-access-key" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_linux_web_app.slackbotwebapp will be updated in-place
  ~ resource "azurerm_linux_web_app" "slackbotwebapp" {
        id                                = "/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Web/sites/slackbotwebapp"
        name                              = "slackbotwebapp"
      ~ service_plan_id                   = "/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Web/serverfarms/serviceplan" -> "/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/langchain-experiments/providers/Microsoft.Web/serverfarms/serviceplan"
        tags                              = {}
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @gregnwosu, Action: `pull_request`, Working Directory: ``, Workflow: `Build and deploy Python app to Azure Web App - slackbotwebapp`*